In [1]:
import pandas as pd
import os

In [2]:
df1 = pd.read_csv(os.path.join('machine_learning_variables.csv'))
df1 = df1[['UNITID', 'INSTNM']]
df1.head()

   UNITID                               INSTNM
0  100654             Alabama A & M University
1  100663  University of Alabama at Birmingham
2  100690                   Amridge University
3  100706  University of Alabama in Huntsville
4  100724             Alabama State University

In [3]:
df1.nunique()

UNITID    7703
INSTNM    7522
dtype: int64

In [4]:
df2 = pd.read_csv(os.path.join('FourYearUniversities.csv'))
df2 = df2[['UNITID']]
df2.head()

   UNITID
0  100654
1  100663
2  100690
3  100706
4  100724

In [5]:
df2.nunique()

UNITID    1841
dtype: int64

In [6]:
df3 = pd.merge(df2,df1, on='UNITID', how='inner')

In [7]:
df3.head()

   UNITID                               INSTNM
0  100654             Alabama A & M University
1  100663  University of Alabama at Birmingham
2  100690                   Amridge University
3  100706  University of Alabama in Huntsville
4  100724             Alabama State University

In [8]:
df3.nunique()

UNITID    1841
INSTNM    1824
dtype: int64

In [9]:
# df3.to_csv(os.path.join('API_SQL_UNITID-NAME.csv'))

In [10]:
metadata1 = pd.read_csv(os.path.join('metadata_needs_join.csv'))
metadata1.head()

,UNITID,CONTROL,TUITIONFEE_IN,TUITIONFEE_OUT,SAT_AVG_ALL,TUITFTE,GRAD_DEBT_MDN,FAMINC,MEAN_EARN_6,MEAN_EARN_8,MEAN_EARN_10
0,100654,Public,9096.0,16596.0,827.0,9427.0,32750,30721.91065,28400,30600,35500
1,100663,Public,7510.0,17062.0,1107.0,9899.0,20750,51156.58905,39400,44100,48400
2,100690,Private,6900.0,6900.0,NaN,12459.0,22829,20279.24856,35400,40800,47600
3,100706,Public,9158.0,21232.0,1219.0,8956.0,23250,54853.90207,40300,45900,52000
4,100724,Public,8720.0,15656.0,851.0,7733.0,32500,30283.78104,24400,27500,30600

In [11]:
metadata = pd.merge(metadata1,df3, on='UNITID', how='inner')

In [12]:
metadata.head()

,UNITID,CONTROL,TUITIONFEE_IN,TUITIONFEE_OUT,SAT_AVG_ALL,TUITFTE,GRAD_DEBT_MDN,FAMINC,MEAN_EARN_6,MEAN_EARN_8,MEAN_EARN_10,INSTNM
0,100654,Public,9096.0,16596.0,827.0,9427.0,32750,30721.91065,28400,30600,35500,Alabama A & M University
1,100663,Public,7510.0,17062.0,1107.0,9899.0,20750,51156.58905,39400,44100,48400,University of Alabama at Birmingham
2,100690,Private,6900.0,6900.0,NaN,12459.0,22829,20279.24856,35400,40800,47600,Amridge University
3,100706,Public,9158.0,21232.0,1219.0,8956.0,23250,54853.90207,40300,45900,52000,University of Alabama in Huntsville
4,100724,Public,8720.0,15656.0,851.0,7733.0,32500,30283.78104,24400,27500,30600,Alabama State University

In [13]:
metadata.shape

(1841, 12)

In [14]:
## Now that the metadata is alltogether, I need to join with the ml_data.csv which contains the machine learning data for prediction. 
# Import ml_data.csv
ml_data = pd.read_csv(os.path.join('ml_data.csv'))
ml_data.head()

,Unnamed: 0,UNITID,ADM_RATE_ALL,AVGFACSAL,RET_FT4,CDR3,AGE_ENTRY,UGDS_MEN
0,0,100654,0.5256,6892.0,0.6595,0.172,20.525773,0.4831
1,1,100663,0.8569,9957.0,0.8288,0.062,23.492140,0.4169
2,2,100706,0.8203,9302.0,0.7696,0.061,23.718723,0.5733
3,3,100724,0.5326,6609.0,0.5725,0.156,20.528185,0.3877
4,4,100751,0.5105,9667.0,0.8670,0.063,21.356529,0.4580

In [15]:
ml_data.shape

(994, 8)

In [16]:
final = pd.merge(metadata,ml_data, on='UNITID', how='inner')

In [21]:
final_export = final[['UNITID',
                      'INSTNM',
                      'CONTROL',
                      'TUITIONFEE_IN',
                      'TUITIONFEE_OUT',
                      'SAT_AVG_ALL',
                      'TUITFTE',
                      'GRAD_DEBT_MDN',
                      'FAMINC',
                      'MEAN_EARN_6',
                      'MEAN_EARN_8',
                      'MEAN_EARN_10',
                      'ADM_RATE_ALL',
                      'AVGFACSAL',
                      'RET_FT4',
                      'CDR3',
                      'AGE_ENTRY',
                      'UGDS_MEN']]

In [22]:
final_export.head()

,UNITID,INSTNM,CONTROL,TUITIONFEE_IN,TUITIONFEE_OUT,SAT_AVG_ALL,TUITFTE,GRAD_DEBT_MDN,FAMINC,MEAN_EARN_6,MEAN_EARN_8,MEAN_EARN_10,ADM_RATE_ALL,AVGFACSAL,RET_FT4,CDR3,AGE_ENTRY,UGDS_MEN
0,100654,Alabama A & M University,Public,9096.0,16596.0,827.0,9427.0,32750,30721.91065,28400,30600,35500,0.5256,6892.0,0.6595,0.172,20.525773,0.4831
1,100663,University of Alabama at Birmingham,Public,7510.0,17062.0,1107.0,9899.0,20750,51156.58905,39400,44100,48400,0.8569,9957.0,0.8288,0.062,23.492140,0.4169
2,100706,University of Alabama in Huntsville,Public,9158.0,21232.0,1219.0,8956.0,23250,54853.90207,40300,45900,52000,0.8203,9302.0,0.7696,0.061,23.718723,0.5733
3,100724,Alabama State University,Public,8720.0,15656.0,851.0,7733.0,32500,30283.78104,24400,27500,30600,0.5326,6609.0,0.5725,0.156,20.528185,0.3877
4,100751,The University of Alabama,Public,9826.0,24950.0,1185.0,12791.0,23250,90097.06928,42400,45600,51600,0.5105,9667.0,0.8670,0.063,21.356529,0.4580

In [23]:
final_export.to_csv(os.path.join('metadata.csv'))